       IDENTIFICATION DIVISION.
       PROGRAM-ID. FileHandlingProgram.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RECORDS.
       05 WS-RECORD PIC X(100).

       PROCEDURE DIVISION.
           DISPLAY "File Handling Program in COBOL".

      * TODO: Assigned Tasks
      * Aleck: Add new record
      * Jas: Display all records
      * Loise: Update an existing record
      * Ash: Delete a record
      * Mik: Search for a specific record

           STOP RUN.
